// Практика з лекції. Для тренування скілів
// Задача 1: Напишіть програму на JavaScript, яка приймає число від користувача і визначає, чи є введене число парним чи непарним.

/* let num = prompt("input number, please"); //оголосили змінну, яку отримаємо з поля вводу, користувачем
if (num % 2 == 0)
{
    console.log("Число " + num + " - парне.");
}
else
{
    console.log("Число " + num + " - непарне.");
} */

/* Задачка 2: Калькулятор знижки (самостійно)
Створіть програму, яка запитує в користувача суму покупки і визначає, яка знижка буде застосована в залежності від суми:
- Якщо сума менше або дорівнює 1000 грн, знижка складає 5%.
- Якщо сума більше 1000 грн, але менше або дорівнює 5000 грн, знижка складає 10%.
- Якщо сума більше 5000 грн, знижка складає 15%.

Вивести суму до оплати з урахуванням знижки */

/* let amount = prompt("Введіть суму покупки","0"); //оголосили змінну, яку отримаємо з поля вводу, користувачем
let discount

if (amount <= 1000)
{
    discount = "5%"
    console.log("Вітаємо, Ваша знижка 5%")
}
else if ((amount > 1000) && (amount <= 5000) )
{
    discount = "10%"
    console.log("Вітаємо, Ваша знижка 10%")
}
else if (amount > 5000)
{
    discount = "15%"
    console.log("Вітаємо, Ваша знижка 15%")
}
else 
{
    console.log("Перевірте та введіть правилльну суму покупки. Знижечка вас зачекалася!")
} */

// з підказками з лекції

/* let amount = 1;
let discount = 0;

if (amount <= 1000 && amount > 0)
{
    discount = 0.05 //5%
}
else if ((amount > 1000) && (amount <= 5000) )
{
    discount = 0.10 //10%
}
else if (amount > 5000)
{
    discount = 0.15 //15%
}
else 
{
    console.log("Перевірте та введіть правилльну суму покупки. Знижечка вас зачекалася!")
}

var discountedAmount = amount - (amount * discount);

console.log("Сума покупки: "+ amount + " грн" )
console.log("Знижка: "+ (discount * 100) + "%" )
console.log("Сума до сплати: "+ discountedAmount + " грн" ) */
    

//Домашнє завдання:
//Необхідно написати програму, яка буде виводити інформацію за умовами, при яких число виводитиметься з правильним словом: "рік", "роки" або "років"(тобто "29 років" чи "4 роки").
//Умови виконання ДЗ:
//Рік отримувати через prompt()
//Зробити перевірку, що користувач ввів число, і це число не є відʼємним.
//Не використовувати функції або інші матеріали, які ми не вивчали.
//Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки.
//Будь ласка, надайте наступні дані для перевірки вашої роботи:
//Посилання на вашу гілку js_homework2, в якій міститиметься файл з виконаним завданням.

let age = -5//prompt("Скільки Вам повних років?", "18"); //ввід змінної через діалогове вікно в браузері

if (age === 1)
{
    console.log("Вам "+ age + " рік")
}
else if (age === 2)
{
    console.log("Вам "+ age + " роки")
}
else if (age === 5)
{
    console.log("Вам "+ age + " років")
}
else 
{
    console.log("Ви ввели ввід.ємне число")
} 