//Домашнє завдання 4:

//Необхідно написати програму, яка буде виводити інформацію за умовами, при яких число виводитиметься з правильним словом: "рік", "роки" або "років"(тобто "29 років" чи "4 роки").
//Умови виконання ДЗ:
//Рік отримувати через prompt()
//Зробити перевірку, що користувач ввів число, і це число не є відʼємним.
//Не використовувати функції або інші матеріали, які ми не вивчали.
//Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки.
//Будь ласка, надайте наступні дані для перевірки вашої роботи:
//Посилання на вашу гілку js_homework2, в якій міститиметься файл з виконаним завданням.


//let age ="nine"; //для тренування без промпт

/* let age = +prompt("Скільки Вам повних років?", "18"); //ввід змінної через діалогове вікно в браузері

if ((age === 1) || (age % 10 == 1) && (age > 20)) //1 або всі числа більше 20, які діляться на 10 з остачею 1
{
    console.log("Вам "+ age + " рік")
}
else if (age < 5 || (age % 10 == 2 || age % 10 == 3 || age % 10 == 4) && (age > 21)) // числа менші за 5 (1 вже врахувалося в першій умові) або числа які при діленні на 10 дають остачу 2,3,4, і більші за 21
{
    console.log("Вам "+ age + " роки")
}
else if (age % 10 == 0 ||  age % 10 == 5 ||  age % 10 == 6 ||  age % 10 == 7 ||  age % 10 == 8 ||  age % 10 == 9 || age >=5 && age <= 20) // числа, які при діленні на 10 дають остачу 0,5,6,7,8,9 або в діапазоні від 5 до 20 включно
{
    console.log("Вам "+ age + " років")
} 
else if (age < 0) //перевірка на від'ємне число
{
    console.log("Ви ввели від'ємне число")
} 
else //наприклад для стрігнового значення
{
    console.log("упс...щось пішло не так")
}  */


//Робота над помилками:
// 1. Помилка: Перевірка на від'ємне число (age < 0) повинна бути першою, інакше вона може не спрацювати правильно. Перенести перевірку на початок
// 2. Помилка: Логічні оператори && та || мають різний пріоритет. Умова (age % 10 == 1) && (age > 20) виконується першою, що може дати помилковий результат.Виправлення: Додати дужки
// 3. Помилка: занадто багато умов. Достатньо описати випадки, де найменша кількість, все інше в остунньому else
// 4. Отимізація: можна винести вибір слова у змінну, а потім виводити лише один console.log, оголосивши в середині конструкції змінну для слова. 
//  ${... } — це інтерполяція змінних у шаблонних рядках(template literals). Інтерполяція означає підставлення значення змінної всередину рядка без необхідності використовувати оператор + для конкатенації.

//от так буде правильніше та оптимізованіше:

let age = +prompt("Скільки Вам повних років?", "18"); // ввід змінної через діалогове вікно в браузері
//let age = 36
if (age < 0) { // перевірка на від'ємне число
    console.log("Ви ввели від'ємне число");
}
else {
    let word;
    if (age % 10 === 1 && age !== 11) { // "1 рік", але не 11
        word = "рік";
    }
    else if ((age % 10 >= 2 && age % 10 <= 4) && !(age >= 12 && age <= 14)) { // "2-4 роки", але не 12-14
        word = "роки";
    } else { // всі інші випадки, "5, 6, 7... років"
        word = "років";
    }
      console.log(`Вам ${age} ${word}`);
}




//Домашнє завдання 5:

//Напишіть програму яка буде приймати два значення, перше це одиниця вимірювання (кілометри, години та кілограми), друге значення це кількість, а потім переводити ці значення:
//кілометри - в метри, години - в хвилини, кілограми - в грами
//Зробити вивід отриманої інформації у вигляді - "10 км це 10000 м" або "1 год це 60хв", або "1 кг це 1000 г".
//Умови виконання ДЗ:
//В задачі не обовʼязково викорисутовувати prompt, просто запишіть значення в зміні.
//Обовʼязково при написанні завдання використовуйте switch
//Продумати варінат, якщо буде введена якась інша одиниця виміру
//Мудрувати та створювати валідацію не потрібно
//Для перевірки вашої роботи:
//Додайте ДЗ у гілку js_homework2
//Вишліть посилання на вашу гілку

var measureUnit = "год" //змінна рядок, одиниці вимірювання
var value = 0.137; //змінна число, значення

switch (measureUnit) {
    case "км": //значення з яким порівнюється наше messureUnit
        var result = value * 1000
        console.log(value + ' '+ measureUnit + " це " + result + " м"); //робюимо ось це
        break;//припиняється дія світча
    case "год":
        var result = value * 60
        console.log(value + ' '+ measureUnit + " це " + result + " хв"); //робюимо ось це
        break;
    case "кг":
        var result = value * 1000
        console.log(value + ' '+ measureUnit + " це " + result + " г"); //робюимо ось це
        break;
    default: //якщо не зустрілося потрібного, тоді по дефолту виконається
        console.log('упс...такої величини немає в переліку');
}


//Робота над помилками та оптимізація:
// 1. правопис measureUnit 
// 2. var result повторюється в кожному блоці. Краще оголосити let result; перед switch і використовувати її в кейсах.

var measureUnit = "км" //змінна рядок, одиниці вимірювання
var value = 15; //змінна число, значення

let result
switch (measureUnit) {
    case "км": //значення з яким порівнюється наше messureUnit
        result = value * 1000
        console.log(value + ' '+ measureUnit + " це " + result + " м"); //робюимо ось це
        break;//припиняється дія світча
    case "год":
        result = value * 60
        console.log(value + ' '+ measureUnit + " це " + result + " хв"); //робюимо ось це
        break;
    case "кг":
        result = value * 1000
        console.log(value + ' '+ measureUnit + " це " + result + " г"); //робюимо ось це
        break;
    default: //якщо не зустрілося потрібного, тоді по дефолту виконається
        console.log('упс...такої величини немає в переліку');
}



// Практика з лекції. Для тренування скілів
// Задача 1: Напишіть програму на JavaScript, яка приймає число від користувача і визначає, чи є введене число парним чи непарним.

/* let num = prompt("input number, please"); //оголосили змінну, яку отримаємо з поля вводу, користувачем
if (num % 2 == 0)
{
    console.log("Число " + num + " - парне.");
}
else
{
    console.log("Число " + num + " - непарне.");
} */

/* Задачка 2: Калькулятор знижки (самостійно)
Створіть програму, яка запитує в користувача суму покупки і визначає, яка знижка буде застосована в залежності від суми:
- Якщо сума менше або дорівнює 1000 грн, знижка складає 5%.
- Якщо сума більше 1000 грн, але менше або дорівнює 5000 грн, знижка складає 10%.
- Якщо сума більше 5000 грн, знижка складає 15%.
Вивести суму до оплати з урахуванням знижки */

/* let amount = prompt("Введіть суму покупки","0"); //оголосили змінну, яку отримаємо з поля вводу, користувачем
let discount

if (amount <= 1000)
{
    discount = "5%"
    console.log("Вітаємо, Ваша знижка 5%")
}
else if ((amount > 1000) && (amount <= 5000) )
{
    discount = "10%"
    console.log("Вітаємо, Ваша знижка 10%")
}
else if (amount > 5000)
{
    discount = "15%"
    console.log("Вітаємо, Ваша знижка 15%")
}
else 
{
    console.log("Перевірте та введіть правилльну суму покупки. Знижечка вас зачекалася!")
} */

// з підказками з лекції

/* let amount = 1;
let discount = 0;

if (amount <= 1000 && amount > 0)
{
    discount = 0.05 //5%
}
else if ((amount > 1000) && (amount <= 5000) )
{
    discount = 0.10 //10%
}
else if (amount > 5000)
{
    discount = 0.15 //15%
}
else 
{
    console.log("Перевірте та введіть правилльну суму покупки. Знижечка вас зачекалася!")
}

var discountedAmount = amount - (amount * discount);

console.log("Сума покупки: "+ amount + " грн" )
console.log("Знижка: "+ (discount * 100) + "%" )
console.log("Сума до сплати: "+ discountedAmount + " грн" ) */
