
let age = 9; //для тренування без промпт

//let age = +prompt("Скільки Вам повних років?", "18"); //ввід змінної через діалогове вікно в браузері

if ((age === 1) || (age % 10 == 1) && (age > 20)) //1 або всі числа більше 20, які діляться на 10 з остачею 1
{
    console.log("Вам "+ age + " рік")
}
else if (age < 5 || (age % 10 == 2 || age % 10 == 3 || age % 10 == 4) && (age > 21)) // числа менші за 5 (1 вже врахувалося в першій умові) або числа які при діленні на 10 дають остачу 2,3,4, і більші за 21
{
    console.log("Вам "+ age + " роки")
}
else if (age % 10 == 0 ||  age % 10 == 5 ||  age % 10 == 6 ||  age % 10 == 7 ||  age % 10 == 8 ||  age % 10 == 9 || age >=5 && age <= 20) // числа, які при діленні на 10 дають остачу 0,5,6,7,8,9 або в діапазоні від 5 до 20 включно
{
    console.log("Вам "+ age + " років")
} 
else if (age < 0) //перевірка на від'ємне число
{
    console.log("Ви ввели від'ємне число")
} 
else //наприклад для стрігнового значення
{
    console.log("упс...щось пішло не так")
} 