//Домашнє завдання 4:

//Необхідно написати програму, яка буде виводити інформацію за умовами, при яких число виводитиметься з правильним словом: "рік", "роки" або "років"(тобто "29 років" чи "4 роки").
//Умови виконання ДЗ:
//Рік отримувати через prompt()
//Зробити перевірку, що користувач ввів число, і це число не є відʼємним.
//Не використовувати функції або інші матеріали, які ми не вивчали.
//Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки.
//Будь ласка, надайте наступні дані для перевірки вашої роботи:
//Посилання на вашу гілку js_homework2, в якій міститиметься файл з виконаним завданням.


//це мій най-найперший варіант

//let age = +prompt("Скільки Вам повних років?", "18"); //ввід змінної через діалогове вікно в браузері
let age = 9; //для тренування без промпт

if ((age === 1) || (age % 10 == 1) && (age > 20)) //1 або всі числа більше 20, які діляться на 10 з остачею 1
{
    console.log("Вам "+ age + " рік")
}
else if (age < 5 || (age % 10 == 2 || age % 10 == 3 || age % 10 == 4) && (age > 21)) // числа менші за 5 (1 вже врахувалося в першій умові) або числа які при діленні на 10 дають остачу 2,3,4, і більші за 21
{
    console.log("Вам "+ age + " роки")
}
else if (age % 10 == 0 ||  age % 10 == 5 ||  age % 10 == 6 ||  age % 10 == 7 ||  age % 10 == 8 ||  age % 10 == 9 || age >=5 && age <= 20) // числа, які при діленні на 10 дають остачу 0,5,6,7,8,9 або в діапазоні від 5 до 20 включно
{
    console.log("Вам "+ age + " років")
} 
else if (age < 0) //перевірка на від'ємне число
{
    console.log("Ви ввели від'ємне число")
} 
else //наприклад для стрігнового значення
{
    console.log("упс...щось пішло не так")
} 

//Робота над помилками:
// 1. Помилка: Перевірка на від'ємне число (age < 0) повинна бути першою, інакше вона може не спрацювати правильно. Перенести перевірку на початок
// 2. Помилка: Логічні оператори && та || мають різний пріоритет. Умова (age % 10 == 1) && (age > 20) виконується першою, що може дати помилковий результат.Виправлення: Додати дужки
// 3. Помилка: занадто багато умов. Достатньо описати випадки, де найменша кількість, все інше в останньому else
// 4. Отимізація: можна винести вибір слова у змінну, а потім виводити лише один console.log, оголосивши в середині конструкції змінну для слова. 


//от так буде правильніше та оптимізованіше:

//let age = +prompt("Скільки Вам повних років?", "18"); // ввід змінної через діалогове вікно в браузері
let age = 13

if (age < 0) { // перевірка на від'ємне число
    console.log("Ви ввели від'ємне число");
}
else {
    let word;
    if (age % 10 === 1 && age !== 11) { // "1 рік", але не 11
        word = "рік";
    }
    else if ((age % 10 >= 2 && age % 10 <= 4) && !(age >= 12 && age <= 14)) { // "2-4 роки", але не 12-14
        word = "роки";
    } else { // всі інші випадки, "5, 6, 7... років"
        word = "років";
    }
      console.log('Вам '+ age + ' '+ word);
}

//впевнена можна ще щось оптимізувати і покращити