//ДЗ: намалювати прямокутний трикутник із зірочок (або чогось)

// варіант перший з Function Declaration, та циклом for

//функція з аргументами: кількість ряків, символ заповнення

function drawTriangle(rows, fill) {
    //Починаємо цикл з i = 1 (номер рядка), j = fill (один символ)
    //Умова: для рядків, кількість яких менше або дорівнює кількості рядків в аргументі функції
    //На кожному кроці: збільшуємо i на 1 (наступний рядок) і додаємо ще один символ
    for (let i = 1, j = fill; i <= rows; i++, j += fill)
{
    console.log(j); //поки умова виконується - виводимо в консолі заповнений рядок
}
}
drawTriangle(5, '\u2605')

//варіант дрйгий з Function Expression, та циклом while

const drawTriangle = function (rows, fill) {
//Ініціалізація змінних:   
    let i = 0; //номер рядка
    let j = fill; //перший символ для виведення
    // Цикл буде виконуватися поки лічильник і менше кількості рядків 
    // Кожен наступний крок: виводимо рядок з додаванням одного символа,
    while (i < rows) {
        console.log(j);
        j += fill;
        i++;
    }
}
drawTriangle(6, '😻')

