//Написати функцію pow(x,y) яка буде приймати 2 числа, перше - це число яке ми будемо зводити у ступінь, друге - у яку ступінь.
//Наприклад pow(2,3) функція поверне значення 8, тобто два в кубі.

/* function pow(x, y) {
    for (var i = 1, j = 0; j < y; j++ ) {
        i = i * x;
        
    }
    let result = i; // зберігаємо значення i у змінну result
    return result;  // повертаємо result
}

let result = pow(-2, 4);
console.log(result); */

// Коменти:
// 1. одразу прокинути щоб поверталось значення і в "return", без попереднього рядка, в якому створюєш змінну результат (щоб було зрозуміліше, то зімість і - резалт)
// 2. В середині циклу бажано теж let юзать

function pow(x, y) {
    let result = 1;
    for (let j = 0; j < y; j++ ) {
        result *= x;
    }
    return result;  // повертаємо result
}
let result = pow(-2, 4);
console.log(result);
